In [2]:
import pandas as pd

In [3]:
estados = pd.Series(['Minas Gerais', 'Santa Catarina', 'Bahia'])
estados

0      Minas Gerais
1    Santa Catarina
2             Bahia
dtype: object

In [4]:
fabricantes = pd.Series(['BMW', 'Audi', 'Mercedes'])
fabricantes

0         BMW
1        Audi
2    Mercedes
dtype: object

In [5]:
dataframe = pd.DataFrame({'ESTADOS': estados, 'TIPO DE FABRICANTES DE CARRO': fabricantes})
dataframe

          ESTADOS TIPO DE FABRICANTES DE CARRO
0    Minas Gerais                          BMW
1  Santa Catarina                         Audi
2           Bahia                     Mercedes

In [6]:
df = pd.read_csv('./venda-de-carros.csv')
df

  Fabricante       Cor  Quilometragem  Portas          Preco
0     Toyota    Branco         150043       4   R$ 24,000.00
1      Honda  Vermelho          87899       4   R$ 25,000.00
2     Toyota      Azul          32549       3   R$ 27,000.00
3        BMW     Preto          11179       5  R$ 122,000.00
4     Nissan    Branco         213095       4   R$ 13,500.00
5     Toyota     Verde          99213       4   R$ 14,500.00
6      Honda      Azul          45698       4   R$ 17,500.00
7      Honda      Azul          54738       4   R$ 27,000.00
8     Toyota    Branco          60000       4   R$ 26,250.00
9     Nissan    Branco          31600       4   R$ 19,700.00

In [7]:
#diferentes tipos de dados do df
df.dtypes

Fabricante       object
Cor              object
Quilometragem     int64
Portas            int64
Preco            object
dtype: object

In [8]:
#diferentes tipos de dados do dataframe
dataframe.dtypes

ESTADOS                         object
TIPO DE FABRICANTES DE CARRO    object
dtype: object

In [9]:
#verificando as estastítiscas do dataframe
dataframe.describe()

             ESTADOS TIPO DE FABRICANTES DE CARRO
count              3                            3
unique             3                            3
top     Minas Gerais                          BMW
freq               1                            1

In [10]:
#verificando as estastítiscas do df
df.describe()

       Quilometragem     Portas
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [11]:
#Liste mais informações sobre o DataFrame
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   ESTADOS                       3 non-null      object
 1   TIPO DE FABRICANTES DE CARRO  3 non-null      object
dtypes: object(2)
memory usage: 176.0+ bytes

In [12]:
#Liste mais informações sobre o df
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Fabricante     10 non-null     object
 1   Cor            10 non-null     object
 2   Quilometragem  10 non-null     int64
 3   Portas         10 non-null     int64
 4   Preco          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [13]:
# Liste o nome de todas as colunas do dataframe
dataframe.columns

Index(['ESTADOS', 'TIPO DE FABRICANTES DE CARRO'], dtype='object')

In [14]:
# Liste o nome de todas as colunas do df
df.columns

Index(['Fabricante', 'Cor', 'Quilometragem', 'Portas', 'Preco'], dtype='object')

In [15]:
# Exiba apenas as 5 primeiras linhas do DataFrame
dataframe.head(5)

          ESTADOS TIPO DE FABRICANTES DE CARRO
0    Minas Gerais                          BMW
1  Santa Catarina                         Audi
2           Bahia                     Mercedes

In [16]:
# Exiba apenas as 5 primeiras linhas do df
df.head(5)

  Fabricante       Cor  Quilometragem  Portas          Preco
0     Toyota    Branco         150043       4   R$ 24,000.00
1      Honda  Vermelho          87899       4   R$ 25,000.00
2     Toyota      Azul          32549       3   R$ 27,000.00
3        BMW     Preto          11179       5  R$ 122,000.00
4     Nissan    Branco         213095       4   R$ 13,500.00

In [17]:
# Exiba as 5 últimas linhas do DataFrame
dataframe.tail(5)

          ESTADOS TIPO DE FABRICANTES DE CARRO
0    Minas Gerais                          BMW
1  Santa Catarina                         Audi
2           Bahia                     Mercedes

In [18]:
# Exiba as 5 últimas linhas do df
df.tail(5)

  Fabricante     Cor  Quilometragem  Portas         Preco
5     Toyota   Verde          99213       4  R$ 14,500.00
6      Honda    Azul          45698       4  R$ 17,500.00
7      Honda    Azul          54738       4  R$ 27,000.00
8     Toyota  Branco          60000       4  R$ 26,250.00
9     Nissan  Branco          31600       4  R$ 19,700.00

In [19]:
# Utilize .loc para selecionar os dados da linha de índice 3 do DataFrame
dataframe.loc[2]

ESTADOS                            Bahia
TIPO DE FABRICANTES DE CARRO    Mercedes
Name: 2, dtype: object

In [20]:
# Utilize .loc para selecionar os dados da linha de índice 3 do df
df.loc[3]

Fabricante                 BMW
Cor                      Preto
Quilometragem            11179
Portas                       5
Preco            R$ 122,000.00
Name: 3, dtype: object

In [22]:
# Utilize .iloc para exibir os dados que estão na 5° posição do DataFrame
df.iloc[5]

Fabricante             Toyota
Cor                     Verde
Quilometragem           99213
Portas                      4
Preco            R$ 14,500.00
Name: 5, dtype: object

In [23]:
#Selecione a coluna Quilometragem
df['Quilometragem']

0    150043
1     87899
2     32549
3     11179
4    213095
5     99213
6     45698
7     54738
8     60000
9     31600
Name: Quilometragem, dtype: int64

In [25]:
# Calcule a média da coluna Quilometragem
media = df['Quilometragem'].mean()
f'A média da quilometragem é {media}'

'A média da quilometragem é 78601.4'

In [39]:
#Liste os carros que possuem uma quilometragem maior que 100.000
maiorquemil = df['Quilometragem'] > 100000
df[maiorquemil]

  Fabricante     Cor  Quilometragem  Portas         Preco
0     Toyota  Branco         150043       4  R$ 24,000.00
4     Nissan  Branco         213095       4  R$ 13,500.00

In [40]:
#Agrupe as colunas pelo fabricante e calcule a média das outras colunas
fabricantes = df.groupby('Fabricante')
fabricantes.describe()

           Quilometragem                                                   \
                   count           mean            std      min       25%
Fabricante
BMW                  1.0   11179.000000            NaN  11179.0  11179.00
Honda                3.0   62778.333333   22219.728179  45698.0  50218.00
Nissan               2.0  122347.500000  128336.345251  31600.0  76973.75
Toyota               4.0   85451.250000   51015.991325  32549.0  53137.25

                                          Portas                             \
                 50%        75%       max  count  mean  std  min   25%  50%
Fabricante
BMW          11179.0   11179.00   11179.0    1.0  5.00  NaN  5.0  5.00  5.0
Honda        54738.0   71318.50   87899.0    3.0  4.00  0.0  4.0  4.00  4.0
Nissan      122347.5  167721.25  213095.0    2.0  4.00  0.0  4.0  4.00  4.0
Toyota       79606.5  111920.50  150043.0    4.0  3.75  0.5  3.0  3.75  4.0


            75%  max
Fabricante
BMW         5.0  5.0
Honda       4.0  4.0
Nissan      4.0  4.0
Toyota      4.0  4.0